In [45]:
# List of high schools
high_schools = ["Hernandez High School", "Figueroa High School", "Wilson High School",
                "Wright High School"]
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [2]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type": "District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]
high_school_types
#how do you print without the brackets?

[{'High School': 'Griffin', 'Type': 'District'},
 {'High School': 'Figueroa', 'Type': 'District'},
 {'High School': 'Wilson', 'Type': 'Charter'},
 {'High School': 'Wright', 'Type': 'Charter'}]

In [47]:
# List of high schools
high_schools = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School", 
                "Griffin High School", "Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School",
                "Pena High School", "Wright High School", "Rogriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]
high_schools

['Huang High School',
 'Figueroa High School',
 'Shelton High School',
 'Hernandez High School',
 'Griffin High School',
 'Wilson High School',
 'Cabrera High School',
 'Bailey High School',
 'Holden High School',
 'Pena High School',
 'Wright High School',
 'Rogriguez High School',
 'Johnson High School',
 'Ford High School',
 'Thomas High School']

In [48]:
# add the Pandas as dependency
import pandas as pd

In [49]:
# create a Pandas Series from list
school_series = pd.Series(high_schools)
for slist in school_series:
    print(slist)

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffin High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rogriguez High School
Johnson High School
Ford High School
Thomas High School

In [50]:
# a dictionary of high schools
high_school_dicts = [{"School ID": 0, "school name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school name": "Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school name": "Hernandez High School", "type": "District"},
                    {"School ID":4, "school name": "Griffin High School", "type": "Charter"}]

In [51]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [52]:
# three seperate list of info on high schools
school_id = [0, 1, 2, 3, 4]
school_name = ['huang', 'figueroa', 'shelton', 'hernandez', 'griffin']
type_of_school = ['district', 'district', 'charter', 'district', 'charter']

In [53]:
#initialize a new DataFrame
school_df = pd.DataFrame()

In [54]:
# add the list to a new DataFrame
school_df['School ID'] = school_id
school_df['School Name'] = school_name
school_df['Type'] = type_of_school

#print the dataframe
school_df

   School ID School Name      Type
0          0       huang  district
1          1    figueroa  district
2          2     shelton   charter
3          3   hernandez  district
4          4     griffin   charter

In [55]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [57]:
newhs_df = pd.DataFrame(high_schools_dict)
newhs_df

   School ID school_name      type
0          0       huang  district
1          1    figueroa  district
2          2     shelton   charter
3          3   hernandez  district
4          4     griffin   charter

In [60]:
school_df.columns
school_df.index

RangeIndex(start=0, stop=5, step=1)